Pt = 0.118
Qcn = 37.2
Qt_th = 320


 

Qt = 360 * 1.163

# Nt =get_Nt(Qt,Pt)



Q0 = ( 296 * Pt + 1.98 
 * (0.708 * (Qt - 40.74) * 0.99 - 4.7 - 3.085)
+  1.05 * Qt - 0.65 * (Qt-26.48) * pow(10.2 * Pt,-0.07) - 9.3 + Qcn * (0.65 * pow(10.2 * Pt,-0.07) + 0.48) ) / 1.045

Nt = 0.708 * (Qt - 40.74) * 0.99 - (0.023 * Q0 - 4.7) - 3.085

eff = (Nt+Qt)/Q0

print('ном. расход пара (МВт) = ',Q0)
print('ном. расход пара (т/ч) = ',Q0 / 0.627)
print('номинальная мощность = ', Nt)
print('КИТТ = ', eff)
print('тепло/электр. = ',Qt/Nt)